using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace KyoshinEewViewer.Series.KyoshinMonitor.Services;

/// <summary>
/// EEW の地域をまとめるクラス
/// </summary>
public static class EewAreaCompressor
{
	private record EewAreaGroup(string Name, string[] Areas);

	private static readonly EewAreaGroup[] Groups = [
		new ("石狩地方", ["石狩地方北部", "石狩地方中部", "石狩地方南部"]),
		new ("後志地方", ["後志地方北部", "後志地方東部", "後志地方西部"]),
		new ("空知地方", ["空知地方北部", "空知地方中部", "空知地方南部"]),
		new ("北海道道央", ["石狩地方", "後志地方", "空知地方"]),

		new ("渡島地方", ["渡島地方北部", "渡島地方東部", "渡島地方西部"]),
		new ("胆振地方", ["胆振地方西部", "胆振地方中東部"]),
		new ("日高地方", ["日高地方西部", "日高地方中部", "日高地方東部"]),
		new ("北海道道南", ["渡島地方", "檜山地方", "北海道奥尻島", "胆振地方", "日高地方"]),

		new ("上川地方", ["上川地方北部", "上川地方中部", "上川地方南部"]),
		new ("留萌地方", ["留萌地方中北部", "留萌地方南部"]),
		new ("宗谷地方", ["宗谷地方北部", "宗谷地方南部"]),
		new ("北海道道北", ["上川地方", "留萌地方", "宗谷地方", "北海道利尻礼文"]),

		new ("十勝地方", ["十勝地方北部", "十勝地方中部", "十勝地方南部"]),
		new ("釧路地方", ["釧路地方北部", "釧路地方中南部"]),
		new ("根室地方", ["根室地方北部", "根室地方中部", "根室地方南部"]),
		new ("北海道道東", ["網走地方", "北見地方", "紋別地方", "十勝地方", "釧路地方", "根室地方"]),

		new ("北海道", ["北海道道央", "北海道道南", "北海道道北", "北海道道東"]),

		new ("青森県津軽", ["青森県津軽北部", "青森県津軽南部"]),
		new ("青森県", ["青森県津軽", "青森県三八上北", "青森県下北"]),
		new ("岩手県沿岸", ["岩手県沿岸北部", "岩手県沿岸南部"]),
		new ("岩手県内陸", ["岩手県内陸北部", "岩手県内陸南部"]),
		new ("岩手県", ["岩手県沿岸", "岩手県内陸"]),
		new ("宮城県", ["宮城県北部", "宮城県中部", "宮城県南部"]),
		new ("秋田県沿岸", ["秋田県沿岸北部", "秋田県沿岸南部"]),
		new ("秋田県内陸", ["秋田県内陸北部", "秋田県内陸南部"]),
		new ("秋田県", ["秋田県沿岸", "秋田県内陸"]),
		new ("山形県", ["山形県庄内", "山形県最上", "山形県村山", "山形県置賜"]),
		new ("福島県", ["福島県中通り", "福島県浜通り", "福島県会津"]),
		new ("東北地方", ["青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県"]),

		new ("茨城県", ["茨城県北部", "茨城県南部"]),
		new ("栃木県", ["栃木県北部", "栃木県南部"]),
		new ("群馬県", ["群馬県北部", "群馬県南部"]),
		new ("埼玉県", ["埼玉県北部", "埼玉県南部", "埼玉県秩父"]),
		new ("千葉県", ["千葉県北東部", "千葉県北西部", "千葉県南部"]),
		new ("東京都", ["東京都２３区", "東京都多摩東部", "東京都多摩西部"]),
		new ("伊豆諸島", ["伊豆大島", "新島", "神津島", "三宅島", "八丈島"]),
		new ("神奈川県", ["神奈川県東部", "神奈川県西部"]),
		new ("関東地方", ["茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県"]),

		new ("新潟県", ["新潟県上越", "新潟県中越", "新潟県下越", "新潟県佐渡"]),
		new ("富山県", ["富山県東部", "富山県西部"]),
		new ("石川県", ["石川県能登", "石川県加賀"]),
		new ("福井県", ["福井県嶺北", "福井県嶺南"]),
		new ("北陸地方", ["新潟県", "富山県", "石川県", "福井県"]),

		new ("山梨県", ["山梨県東部・富士五湖", "山梨県中・西部"]),
		new ("長野県", ["長野県北部", "長野県中部", "長野県南部"]),
		new ("甲信地方", ["山梨県", "長野県"]),
		new ("関東甲信", ["関東地方", "甲信地方"]),

		new ("岐阜県", ["岐阜県飛騨", "岐阜県美濃東部", "岐阜県美濃中西部"]),
		new ("静岡県", ["静岡県伊豆", "静岡県東部", "静岡県中部", "静岡県西部"]),
		new ("愛知県", ["愛知県東部", "愛知県西部"]),
		new ("三重県", ["三重県北部", "三重県中部", "三重県南部"]),
		new ("東海地方", ["岐阜県", "静岡県", "愛知県", "三重県"]),

		new ("滋賀県", ["滋賀県北部", "滋賀県南部"]),
		new ("京都府", ["京都府北部", "京都府南部"]),
		new ("大阪府", ["大阪府北部", "大阪府南部"]),
		new ("兵庫県", ["兵庫県北部", "兵庫県南東部", "兵庫県南西部", "兵庫県淡路島"]),
		new ("和歌山県", ["和歌山県北部", "和歌山県南部"]),
		new ("近畿地方", ["滋賀県", "京都府", "大阪府", "兵庫県", "奈良県", "和歌山県"]),

		new ("鳥取県", ["鳥取県東部", "鳥取県中部", "鳥取県西部"]),
		new ("島根県", ["島根県東部", "島根県西部", "島根県隠岐"]),
		new ("岡山県", ["岡山県北部", "岡山県南部"]),
		new ("広島県", ["広島県北部", "広島県南東部", "広島県南西部"]),
		new ("山口県", ["山口県北部", "山口県東部", "山口県中部", "山口県西部"]),
		new ("中国地方", ["鳥取県", "島根県", "岡山県", "広島県", "山口県"]),

		new ("徳島県", ["徳島県北部", "徳島県南部"]),
		new ("香川県", ["香川県東部", "香川県西部"]),
		new ("愛媛県", ["愛媛県東予", "愛媛県中予", "愛媛県南予"]),
		new ("高知県", ["高知県東部", "高知県中部", "高知県西部"]),
		new ("四国地方", ["徳島県", "香川県", "愛媛県", "高知県"]),

		new ("福岡県", ["福岡県福岡", "福岡県北九州", "福岡県筑豊", "福岡県筑後"]),
		new ("佐賀県", ["佐賀県北部", "佐賀県南部"]),
		new ("長崎県", ["長崎県北部", "長崎県南西部", "長崎県島原半島", "長崎県対馬", "長崎県壱岐", "長崎県五島"]),
		new ("熊本県", ["熊本県阿蘇", "熊本県熊本", "熊本県球磨", "熊本県天草・芦北"]),
		new ("大分県", ["大分県北部", "大分県中部", "大分県南部", "大分県西部"]),
		new ("宮崎県", ["宮崎県北部平野部", "宮崎県北部山沿い", "宮崎県南部平野部", "宮崎県南部山沿い"]),
		new ("鹿児島県(奄美除く)", ["鹿児島県薩摩", "鹿児島県大隅", "鹿児島県十島村", "鹿児島県甑島", "鹿児島県種子島", "鹿児島県屋久島"]),
		new ("九州地方(奄美除く)", ["福岡県", "佐賀県", "長崎県", "熊本県", "大分県", "宮崎県", "鹿児島県"]),

		new ("奄美群島", ["鹿児島県奄美北部", "鹿児島県奄美南部"]),

		new ("沖縄本島", ["沖縄県本島北部", "沖縄県本島中南部", "沖縄県久米島"]),
		new ("八重山", ["沖縄県石垣島", "沖縄県与那国島", "沖縄県西表島"]),
		new ("沖縄県", ["沖縄本島", "大東島", "宮古島", "八重山"]),
	];

	public static string[] Compress(string[] areas)
	{
		var result = areas.ToList();
		foreach (var group in Groups)
		{
			var groupAreas = group.Areas;
			if (groupAreas.All(result.Contains))
			{
				result.RemoveAll(a => groupAreas.Contains(a));
				result.Insert(0, group.Name);
			}
		}
		return result.ToArray();
	}
}
